-- ムゲンダイナVMAXデッキ
INSERT INTO deck VALUES (
    'master', nextval('DECK_ID_SEQ'), 'ムゲンダイナVMAXデッキ', 
    '{{"S4a124", "ムゲンダイナV", "4"}, {"S4a125", "ムゲンダイナVMAX", "3"}, {"S6a047", "ブラッキーV", "4"}, 
    {"S6a048", "ブラッキーVMAX", "3"}, {"S5a045", "ガラル ファイヤーV", "2"}, {"SGI007", "クロバットV", "4"}, 
    {"S4a110", "ガラル ジグザグマ", "2"}, {"SF008", "クイックボール", "4"}, {"SF015", "ポケモン通信", "4"}, 
    {"SF014", "ポケモンいれかえ", "3"},{"SD102", "大きなおまもり", "2"}, {"SD085", "エネルギーつけかえ", "1"}, 
    {"SC2016", "リセットスタンプ", "2"}, {"SGI017", "博士の研究（アララギ博士）", "4"}, {"SGI018", "冒険家の発見", "4"}, 
    {"SGI019", "ボスの指令（フラダリ）", "1"}, {"SM12a165", "トキワの森", "3"}, {"S-P096", "基本悪エネルギー", "6"}, 
    {"S4a186", "ハイド悪エネルギー", "2"}, {"SM11a", "ウィークガードエネルギー", "2"}}'
);

-- こくばバドレックスVMAXデッキ
INSERT INTO deck VALUES (
    'master', nextval('DECK_ID_SEQ'), 'こくばバドレックスVMAXデッキ', 
    '{{"S6K037", "こくばバドレックスVMAX", "4"}, {"S6K036", "こくばバドレックスV", "4"}, {"S3a031", "マホイップV", "2"}, 
    {"S3a032", "マホイップVMAX", "2"}, {"SM9038", "ゲンガー&ミミッキュGX", "1"}, {"S6K029", "クレセリア", "1"}, 
    {"SM12a064", "マーシャドー", "1"}, {"SM12a048", "デデンネGX", "1"}, {"SGI007", "クロバットV", "1"}, 
    {"SF008", "クイックボール", "3"},{"S6K060", "霧の水晶", "4"}, {"SF009", "しんかのおこう", "2"}, 
    {"SF015", "ポケモン通信", "2"}, {"SF014", "ポケモンいれかえ", "3"}, {"SF017", "ふうせん", "2"}, 
    {"SF013", "ふつうのつりざお", "1"}, {"SGI017", "博士の研究（アララギ博士）", "4"}, {"SF021", "マリィ", "3"}, 
    {"SGI019", "ボスの指令", "3"}, {"SF026", "トレーニングコート", "2"}, {"S-P094", "基本超エネルギー", "14"}}'
);

-- れんげきウーラオスVMAXデッキ
INSERT INTO deck VALUES (
    'master', nextval('DECK_ID_SEQ'), 'れんげきウーラオスVMAXデッキ',
    '{{"S5R050", "れんげきウーラオスV", "4"}, {"S5R051", "れんげきウーラオスVMAX", "3"}, {"S5a016", "メッソン", "4"}, 
    {"S4a040", "ジメレオン", "4"}, {"S5a018", "インテレオン", "3"}, {"S4a041", "インテレオン", "1"}, 
    {"S5a043", "ナゲツケサル", "1"}, {"SM12a055", "ミュウ", "1"}, {"SMM002", "ジラーチGX", "1"}, 
    {"SF008", "クイックボール", "3"}, {"S5R063", "レベルボール", "3"}, {"SF009", "しんかのおこう", "2"}, 
    {"SF015", "ポケモン通信", "2"}, {"SF014", "ポケモンいれかえ", "2"}, {"SM12a143", "Uターンボード", "1"}, 
    {"SM10a047", "くろおび", "1"}, {"S4091", "望遠スコープ", "1"}, {"SM11a059", "ウィークガードエネルギー", "1"}, 
    {"SC2016", "リセットスタンプ", "1"}, {"SGI017", "博士の研究（アララギ博士）", "4"}, {"SF021", "マリィ", "4"}, 
    {"SGI019", "ボスの指令（フラダリ）", "2"}, {"S5R069", "みずの塔", "2"}, {"S6H069", "頂への雪道", "1"}, 
    {"S-P095", "基本闘エネルギー", "4"}, {"SF033", "れんげきエネルギー", "4"}}'
);

-- ゲンガーVMAXデッキ
INSERT INTO deck VALUES (
    'master', nextval('DECK_ID_SEQ'), 'ゲンガーVMAXデッキ',
    '{{"SGG001", "ゲンガーV", "3"}, {"SGG002", "ゲンガーVMAX", "3"}, {"S6a047", "ブラッキーV", "2"}, 
    {"S6a048", "ブラッキーVMAX", "2"}, {"SGG004", "デルビル", "4"}, {"SGG005", "ヘルガー", "4"},
    {"SGI007", "クロバットV", "1"}, {"S5I035", "イシヘンジン", "1"}, {"SM12a055", "ミュウ", "1"},
    {"SF008", "クイックボール", "4"}, {"SF015", "ポケモン通信", "4"}, {"SF014", "ポケモンいれかえ", "4"},
    {"S5a064", "やまびこホーン", "2"}, {"SGG008", "活力の壺", "2"}, {"SGI017", "博士の研究（アララギ博士）", "4"}, 
    {"SF021", "マリィ", "4"}, {"SGI019", "ボスの指令（フラダリ）", "3"}, {"SGG018", "あくの塔", "4"}, 
    {"SF030", "いちげきエネルギー", "4"}, {"S4a186", "ハイド悪エネルギー", "2"}, {"S-P096", "基本悪エネルギー", "2"}}');